In [61]:
import pandas as pd

In [62]:
data = pd.read_csv('Titanic.csv')

In [63]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [64]:
data1 = data.drop(columns=['Name','Ticket','Cabin'],axis=1)
data1.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    male  22.0      1      0   7.2500        S
1            2         1       1  female  38.0      1      0  71.2833        C
2            3         1       3  female  26.0      0      0   7.9250        S
3            4         1       1  female  35.0      1      0  53.1000        S
4            5         0       3    male  35.0      0      0   8.0500        S

In [65]:
data1.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Embarked         2
dtype: int64

In [66]:
data1= pd.get_dummies(data1, columns = ['Sex', 'Embarked'])
data1.head()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,1,0,3,22.0,1,0,7.2500,0,1,0,0,1
1,2,1,1,38.0,1,0,71.2833,1,0,1,0,0
2,3,1,3,26.0,0,0,7.9250,1,0,0,0,1
3,4,1,1,35.0,1,0,53.1000,1,0,0,0,1
4,5,0,3,35.0,0,0,8.0500,0,1,0,0,1

In [67]:
c = data1.pop('Survived')
data1.insert(len(list(data1)), 'Survived', c)
data1.head()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,Survived
0,1,3,22.0,1,0,7.2500,0,1,0,0,1,0
1,2,1,38.0,1,0,71.2833,1,0,1,0,0,1
2,3,3,26.0,0,0,7.9250,1,0,0,0,1,1
3,4,1,35.0,1,0,53.1000,1,0,0,0,1,1
4,5,3,35.0,0,0,8.0500,0,1,0,0,1,0

In [ ]:
titanic_gender = data1[["Sex"]]

##OneHotEncoder
from sklearn.preprocessing import OneHotEncoder
gender_encoder = OneHotEncoder()
titanic_gender1 = gender_encoder.fit_transform(titanic_gender)
titanic_gender1

#converting the array to DataFrame
data3 = pd.DataFrame(titanic_gender1.toarray())
data3

In [ ]:
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(strategy="median")

In [70]:
imputer.fit(data1)

SimpleImputer(strategy='median')

In [71]:
data1.median().values

array([446.    ,   3.    ,  28.    ,   0.    ,   0.    ,  14.4542,
         0.    ,   1.    ,   0.    ,   0.    ,   1.    ,   0.    ])

In [72]:
x = imputer.transform(data1)

In [74]:
housing_tr = pd.DataFrame(x,columns=data1.columns)
housing_tr.isnull().sum()

PassengerId    0
Pclass         0
Age            0
SibSp          0
Parch          0
Fare           0
Sex_female     0
Sex_male       0
Embarked_C     0
Embarked_Q     0
Embarked_S     0
Survived       0
dtype: int64